{
  "backend/main.mo": "Defines the backend actor with authorization, blob storage mixins, and data models for members, check-ins, tasks, notes, messages, announcements, and user profiles using in-memory maps.",
  "feature_evidence.json": "Lists feature evidence entries mapping feature requests to affected frontend files, components, and test IDs with confidence levels.",
  "frontend-file-summaries.txt": "Provides prewritten summaries of various frontend files describing their purpose, routing roles, and UI behavior.",
  "frontend/index.css": "Tailwind CSS setup defining color variables, dark mode overrides, and base styling for the app.",
  "frontend/index.html": "HTML entry point that loads the React application into the root element via main.tsx.",
  "frontend/src/announcements/AnnouncementComposerPage.tsx": "Form page allowing coaches to compose and publish announcements with fields for title, content, target segment, and publication state.",
  "frontend/src/announcements/AnnouncementsFeedPage.tsx": "Displays a feed of published announcements with titles, segments, and content, or a placeholder when none exist.",
  "frontend/src/App.tsx": "Sets up the TanStack Router, authentication gating, role-based routing, and main application layout rendering.",
  "frontend/src/auth/LoginPage.tsx": "Renders a login screen with coach/member tabs using Internet Identity authentication.",
  "frontend/src/auth/ProfileSetupModal.tsx": "Provides a modal for entering name, role, and optional member ID before saving the user profile.",
  "frontend/src/automations/CoachDigestPage.tsx": "Displays a coach dashboard summarizing overdue and due-today tasks with quick navigation to member details.",
  "frontend/src/automations/ReminderQueuePage.tsx": "Lists members needing daily check‑in reminders and provides WhatsApp reminder actions.",
  "frontend/src/checkins/DailyCheckinPage.tsx": "Form for members to submit daily check‑in metrics and notes, then redirect to their dashboard.",
  "frontend/src/checkins/WeeklyCheckinPage.tsx": "Form for members to submit weekly measurements and reflections before navigating back to their dashboard.",
  "frontend/src/components/AppLayout.tsx": "Layout wrapper that manages navigation, role-specific menus, and logout handling based on Internet Identity authentication.",
  "frontend/src/dashboards/CoachDashboardPage.tsx": "Coach dashboard displaying member stats, task counts, and quick navigation actions using query data.",
  "frontend/src/dashboards/MemberDashboardPage.tsx": "Member dashboard showing streaks, weight progress, check-in data, and shortcuts to check-in pages.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the backend actor instance tied to the authenticated identity, invalidating related queries on change.",
  "frontend/src/hooks/useCurrentUser.ts": "Fetches and exposes the current user's profile and role flags based on the active actor and identity.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context, handling login, logout, identity loading, and status tracking.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for members, check-ins, tasks, and announcements, using the backend actor for data access.",
  "frontend/src/index.css": "Sets Tailwind layers and defines CSS variables for light/dark themes and base element styling.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers.",
  "frontend/src/members/MemberFormDialog.tsx": "Dialog component for creating or editing a member profile with form state and mutation calls.",
  "frontend/src/members/MemberListPage.tsx": "Displays searchable member list with cards and an add-member dialog trigger.",
  "frontend/src/members/MemberProfilePage.tsx": "Shows detailed member profile, stats, actions, and an edit dialog, with clipboard support for member ID.",
  "frontend/src/messaging/templates.ts": "Defines WhatsApp message templates and a helper to substitute variables.",
  "frontend/src/messaging/WhatsAppActions.tsx": "Provides WhatsApp message sending using templates and logs message attempts.",
  "frontend/src/reports/csv.ts": "Utility for converting data arrays to CSV files and triggering downloads.",
  "frontend/src/reports/ReportsExportPage.tsx": "UI for exporting members, check-ins, and message logs to CSV.",
  "frontend/src/settings/SettingsPage.tsx": "Renders settings UI for reminder times and follow-up frequency with save button.",
  "frontend/src/tasks/TaskListPage.tsx": "Displays follow-up task stats and lists tasks by status with completion actions.",
  "frontend/src/tasks/TaskStatusPill.tsx": "Shows a badge indicating task status using predefined variant-label mappings.",
  "frontend/src/timeline/MemberTimeline.tsx": "Builds a unified timeline of member activity from various data sources with filtering options.",
  "frontend/src/utils/clipboard.ts": "Provides a clipboard copy utility with modern API and fallback support.",
  "frontend/src/utils/roles.ts": "Utility helpers for checking user roles and generating role labels.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading, persisting, and clearing URL and session parameters.",
  "frontend/tailwind.config.js": "Configures Tailwind CSS theme, colors, extensions, and plugins for the frontend.",
  "project_state.json": "Defines the project’s current state, architecture notes, known issues, and existing features for a mobile-first coaching app with WhatsApp messaging and scheduled automations."
}