{
  "backend/main.mo": "Defines the main actor with authorization, blob storage, and all domain types plus in‑memory maps for members, check-ins, tasks, notes, messages, announcements, and user profiles.",
  "backend/migration.mo": "Provides a migration that adds lastWeightUpdate to existing member profiles by transforming an old members map into a new format.",
  "feature_evidence.json": "Lists feature evidence entries linking frontend files, components, and tests to two weight‑update‑related product features.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of key frontend files, including routing, profile setup, role helpers, member pages, and dashboard behavior.",
  "frontend/index.css": "Tailwind CSS base file defining theme variables for light and dark modes and applying global background/foreground styles.",
  "frontend/index.html": "HTML entry point that loads the React app via main.tsx into a root div.",
  "frontend/src/announcements/AnnouncementComposerPage.tsx": "Form page for creating announcements with title, content, segment selection, publish toggle, and submission via createAnnouncement mutation.",
  "frontend/src/announcements/AnnouncementsFeedPage.tsx": "Displays a list of published announcements in cards, falling back to an empty state if none exist.",
  "frontend/src/App.tsx": "Sets up the full TanStack Router tree, authentication gating, profile setup flow, and role-based routing to coach or member dashboards.",
  "frontend/src/auth/loginIntent.ts": "Utilities to store, read, and clear login intent (coach or member) in sessionStorage.",
  "frontend/src/auth/LoginPage.tsx": "Login UI allowing users to choose coach or member role and trigger Internet Identity login with selected intent.",
  "frontend/src/auth/ProfileSetupModal.tsx": "Modal for initial profile setup where users enter name, choose role, optionally link member via phone, and submit to backend.",
  "frontend/src/automations/CoachDigestPage.tsx": "Dashboard summarizing overdue and due-today follow‑up tasks with quick access to member details.",
  "frontend/src/automations/ReminderQueuePage.tsx": "Page listing members needing daily check-in reminders and providing WhatsApp action options.",
  "frontend/src/checkins/DailyCheckinPage.tsx": "Form for members to submit daily health metrics and notes, then navigate to member dashboard.",
  "frontend/src/checkins/WeeklyCheckinPage.tsx": "Form for members to submit weekly measurements, reflections, and progress updates.",
  "frontend/src/components/AppLayout.tsx": "Layout component that manages navigation, authentication state, and role-based menus for coach and member views.",
  "frontend/src/dashboards/CoachDashboardPage.tsx": "Coach dashboard showing member counts, activity stats, task summaries, and quick navigation actions.",
  "frontend/src/dashboards/MemberDashboardPage.tsx": "Member dashboard displaying streaks, weight progress, recent check‑ins, and shortcuts to check‑in and profile pages.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the backend actor tied to the user's identity, refreshing dependent queries when it changes.",
  "frontend/src/hooks/useCurrentUser.ts": "Fetches and exposes the logged-in user's profile and role information using the actor.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides authentication context using Internet Identity, including login, logout, and identity persistence.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for CRUD operations on members, check-ins, tasks, notes, messages, and announcements via the actor.",
  "frontend/src/index.css": "Sets Tailwind layers and defines light/dark theme CSS variables plus base element styles.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with React Query and InternetIdentityProvider.",
  "frontend/src/members/MemberFormDialog.tsx": "Dialog form for creating or editing a member profile with validation and mutation hooks.",
  "frontend/src/members/MemberListPage.tsx": "Displays searchable member list with cards and includes a dialog for adding new members.",
  "frontend/src/members/MemberProfilePage.tsx": "Shows detailed member profile, allows coaches to edit data, and supports weight updates and timeline view.",
  "frontend/src/messaging/templates.ts": "Defines WhatsApp message templates and a helper to substitute member names.",
  "frontend/src/messaging/WhatsAppActions.tsx": "Lets coaches send templated WhatsApp messages and logs each message attempt.",
  "frontend/src/reports/csv.ts": "Utility for converting records to CSV and triggering file downloads.",
  "frontend/src/reports/ReportsExportPage.tsx": "Exports members, check-ins, and message logs to CSV using query data.",
  "frontend/src/settings/SettingsPage.tsx": "Displays settings for reminder times and follow-up frequency with inputs and a save button.",
  "frontend/src/tasks/TaskListPage.tsx": "Fetches and categorizes follow-up tasks, showing task counts, tabs, and cards with completion actions.",
  "frontend/src/tasks/TaskStatusPill.tsx": "Renders a status badge based on task status using predefined variants.",
  "frontend/src/timeline/MemberTimeline.tsx": "Aggregates various member-related events into a sortable timeline with filtering controls.",
  "frontend/src/utils/clipboard.ts": "Provides a clipboard copy utility with modern API support and a fallback method.",
  "frontend/src/utils/roles.ts": "Utilities for checking user roles and generating human-readable role labels.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading, persisting, and clearing URL parameters with sessionStorage support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending theme colors, animations, and plugins.",
  "project_state.json": "Tracks project metadata, features, and new feature requests for weight update functionality."
}