{
  "kind": "build_request",
  "title": "Allow members to enter and update their own weight",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "When a member submits a weekly check-in, persist the submitted `weight` as the member’s latest `currentWeight` so the member can update their own weight without coach intervention.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "the member should be able to enter his own weight"
        ]
      },
      "acceptanceCriteria": [
        "Submitting `submitWeeklyCheckin` as a member updates the stored WeeklyCheckin record and also updates the corresponding `MemberProfile.currentWeight` for that same `memberId`.",
        "A member cannot update `currentWeight` for any other memberId; backend continues to enforce ownership checks.",
        "Coach/staff/admin behavior remains unchanged (they can still view all members/check-ins as before)."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Add a member-facing UI control to update their current weight directly from the Member Profile page, and persist it to the backend with appropriate authorization checks.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "the member should be able to enter his own weight"
        ]
      },
      "acceptanceCriteria": [
        "On `MemberProfilePage`, when the logged-in user is a member viewing their own profile, show an \"Update Weight\" action and a simple form with a numeric input labeled \"Current weight (kg)\" and a Save button.",
        "Saving updates the member’s stored `currentWeight` and refreshes any relevant queries so the new weight is reflected immediately on the profile and member dashboard.",
        "Members do not see coach-only profile edit controls (the existing coach \"Edit\" behavior remains coach-only).",
        "If the backend returns an authorization error, show a clear English error message to the user (e.g., \"You can only update your own weight.\")."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Ensure member dashboard weight widgets reflect the member-entered weight consistently by using the latest available stored `currentWeight` and/or latest weekly check-in weight after updates.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "the member should be able to enter his own weight"
        ]
      },
      "acceptanceCriteria": [
        "After a member updates weight (via weekly check-in or the new profile control), `MemberDashboardPage` shows the updated \"Current Weight\" value without requiring a hard refresh.",
        "If a latest weekly check-in exists, the dashboard continues to prefer that value; otherwise it uses `MemberProfile.currentWeight`, and both remain consistent after updates."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single Motoko actor in `backend/main.mo` (no additional backend services).",
    "Do not edit files under `frontend/src/components/ui` or any other paths listed as immutable in system context."
  ],
  "nonGoals": [
    "Adding coach-facing features for setting member weight beyond the existing member profile edit flow.",
    "Adding new third-party integrations (devices, scales, health APIs).",
    "Changing the authentication system (Internet Identity remains the only auth mechanism)."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}